In [11]:
import pandas as pd
weather_data = {
    'day':['1/1/1111','2/2/2222','3/3/3333','4/4/4444','5/5/5555','6/6/6666','7/7/7777'],
    'Temperature':[32,33,28,21,25,40,30],
    'Windspeed':[5,7,3,4,9,1,6],
    'Event':['Rain','Sunny','Snow','Rain','Sunny','snow','Rain']
}
#df.pd.readcsv("weather_data.csv")
df = pd.DataFrame(weather_data)
df

        day  Temperature  Windspeed  Event
0  1/1/1111           32          5   Rain
1  2/2/2222           33          7  Sunny
2  3/3/3333           28          3   Snow
3  4/4/4444           21          4   Rain
4  5/5/5555           25          9  Sunny
5  6/6/6666           40          1   snow
6  7/7/7777           30          6   Rain

In [12]:
df.shape #shows shape in rows and collumns

(7, 4)

In [16]:
columns

4

In [14]:
rows #it will only show number of ROWS avaliabe

7

In [18]:
df.head(2) #it will print only two ROWS   #By default it will print top 5

        day  Temperature  Windspeed  Event
0  1/1/1111           32          5   Rain
1  2/2/2222           33          7  Sunny

In [20]:
df.tail() #it will only print last 5 Rows

        day  Temperature  Windspeed  Event
2  3/3/3333           28          3   Snow
3  4/4/4444           21          4   Rain
4  5/5/5555           25          9  Sunny
5  6/6/6666           40          1   snow
6  7/7/7777           30          6   Rain

In [21]:
df.tail(2) #represnt only last 2rows

        day  Temperature  Windspeed Event
5  6/6/6666           40          1  snow
6  7/7/7777           30          6  Rain

In [22]:
df[2:5] #select the number of rows in range

        day  Temperature  Windspeed  Event
2  3/3/3333           28          3   Snow
3  4/4/4444           21          4   Rain
4  5/5/5555           25          9  Sunny

In [23]:
df

        day  Temperature  Windspeed  Event
0  1/1/1111           32          5   Rain
1  2/2/2222           33          7  Sunny
2  3/3/3333           28          3   Snow
3  4/4/4444           21          4   Rain
4  5/5/5555           25          9  Sunny
5  6/6/6666           40          1   snow
6  7/7/7777           30          6   Rain

In [26]:
df.column#it will represent all the column present in table

AttributeError: 'DataFrame' object has no attribute 'column'

In [22]:
df.Event #it will print event column   #or df['Event']

0     Rain
1    Sunny
2     Snow
3     Rain
4    Sunny
5     snow
6     Rain
Name: Event, dtype: object

In [26]:
df['Event']

0     Rain
1    Sunny
2     Snow
3     Rain
4    Sunny
5     snow
6     Rain
Name: Event, dtype: object

In [28]:
df.rows #we can't print rows

AttributeError: 'DataFrame' object has no attribute 'rows'

In [29]:
type(df['Event']) #Point to be noted(PTN) the columns in our dataframe is of type PANDAS SERIES

pandas.core.series.Series

In [30]:
df[['Event','day','Windspeed']]

   Event       day  Windspeed
0   Rain  1/1/1111          5
1  Sunny  2/2/2222          7
2   Snow  3/3/3333          3
3   Rain  4/4/4444          4
4  Sunny  5/5/5555          9
5   snow  6/6/6666          1
6   Rain  7/7/7777          6

In [31]:
df['Temperature'].max()  #maximum temp in dataset   #.min()    ,  .std()

40

In [32]:
df.describe() #search for more PANDAS SERIES for better command of statistic
#is used to view some basic statistical details like percentile, mean, std etc. of a data frame or a series of numeric or integer values

       Temperature  Windspeed
count     7.000000   7.000000
mean     29.857143   5.000000
std       6.094494   2.645751
min      21.000000   1.000000
25%      26.500000   3.500000
50%      30.000000   5.000000
75%      32.500000   6.500000
max      40.000000   9.000000

In [33]:
df[df.Temperature>=32]  #python partially support statement of SQL

        day  Temperature  Windspeed  Event
0  1/1/1111           32          5   Rain
1  2/2/2222           33          7  Sunny
5  6/6/6666           40          1   snow

In [34]:
df[df.Windspeed==df.Windspeed.max()]

        day  Temperature  Windspeed  Event
4  5/5/5555           25          9  Sunny

In [35]:
df[df['Windspeed']==df['Windspeed'].max()]

        day  Temperature  Windspeed  Event
4  5/5/5555           25          9  Sunny

In [36]:
df['day'][df.Windspeed==df.Windspeed.max()]

4    5/5/5555
Name: day, dtype: object

In [37]:
df[['day','Temperature']][df.Windspeed==df.Windspeed.max()]

        day  Temperature
4  5/5/5555           25

In [38]:
df

        day  Temperature  Windspeed  Event
0  1/1/1111           32          5   Rain
1  2/2/2222           33          7  Sunny
2  3/3/3333           28          3   Snow
3  4/4/4444           21          4   Rain
4  5/5/5555           25          9  Sunny
5  6/6/6666           40          1   snow
6  7/7/7777           30          6   Rain

In [39]:
df.set_index('day', inplace=True)

In [40]:
df

          Temperature  Windspeed  Event
day
1/1/1111           32          5   Rain
2/2/2222           33          7  Sunny
3/3/3333           28          3   Snow
4/4/4444           21          4   Rain
5/5/5555           25          9  Sunny
6/6/6666           40          1   snow
7/7/7777           30          6   Rain

In [41]:
df.loc['1/1/1111']

Temperature      32
Windspeed         5
Event          Rain
Name: 1/1/1111, dtype: object

In [49]:
df.reset_index(inplace=True)

In [50]:
df

   Event       day  Temperature  Windspeed
0   Rain  1/1/1111           32          5
1  Sunny  2/2/2222           33          7
2   Snow  3/3/3333           28          3
3   Rain  4/4/4444           21          4
4  Sunny  5/5/5555           25          9
5   snow  6/6/6666           40          1
6   Rain  7/7/7777           30          6

In [54]:
df.set_index('Event', inplace=True)

KeyError: "None of ['Event'] are in the columns"

In [56]:
df

            day  Temperature  Windspeed
Event
Rain   1/1/1111           32          5
Sunny  2/2/2222           33          7
Snow   3/3/3333           28          3
Rain   4/4/4444           21          4
Sunny  5/5/5555           25          9
snow   6/6/6666           40          1
Rain   7/7/7777           30          6

In [60]:
df.loc[['snow','Snow','Rain']]#location can only be implemented after setting a index

            day  Temperature  Windspeed
Event
snow   6/6/6666           40          1
Snow   3/3/3333           28          3
Rain   1/1/1111           32          5
Rain   4/4/4444           21          4
Rain   7/7/7777           30          6